# Kreuztabelle

In [1]:
import pandas as pd

# Beispiel-Datensatz
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
        'Alter': [23, 35, 45, 28, 22],
        'Gehalt': [70000, 120000, 90000, 80000, 60000],
        'Abteilung': ['HR', 'IT', 'IT', 'Marketing', 'HR']}

df = pd.DataFrame(data)

In [2]:
# Kreuztabelle: Anzahl der Personen in jeder Abteilung
cross_tab = pd.crosstab(df['Abteilung'], df['Name'])
cross_tab

Name       Alice  Bob  Charlie  David  Eva
Abteilung
HR             1    0        0      0    1
IT             0    1        1      0    0
Marketing      0    0        0      1    0

Vergleicht alles mit allem